Revit 2026 API

# SlabShapeVertexArray Methods

---

The SlabShapeVertexArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Append | Add the item to the end of the array. |
|  | Clear | Removes every item from the array, rendering it empty. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert | Insert the specified item into the array. |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

SlabShapeVertexArray Class

Autodesk.Revit.DB Namespace